Eduly Video Platform/old-eduly/app/views/playlists/_form.html.erb

		<%= f.label :advanced_category %>
		<%= f.select :advanced_category_id, AdvancedCategory.order(:advanced_cat_title).collect{ |p| [p.advanced_cat_title, p.id] }, {}, { class: 'form-control' } %>
---
SELECT "advanced_categories".* FROM "advanced_categories"  ORDER BY "advanced_categories"."advanced_cat_title" ASC