Eduly Video Platform/old-eduly/app/views/playlists/show.html.erb

SELECT "videos".* FROM "videos" WHERE "videos"."playlist_id" = $1  [["playlist_id", 1]]
---
	<div class="row">
		<% @playlist.videos.each do |video| %>