Eduly Video Platform/old-eduly/app/controllers/playlists_controller.rb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@number = 0
		@playlist = Playlist.find(params[:id])

INSERT INTO "playlists" ("advanced_category_id", "playlist_title", "playlist_description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@playlist = current_user.playlists.build(playlist_params)

		if @playlist.save