Eduly Video Platform/old-eduly/app/controllers/users_controller.rb

	def show
		user = User.find(current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]