Eduly Video Platform/old-eduly/app/controllers/videos_controller.rb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1  [["user_id", 1]]
SELECT "videos".* FROM "videos" WHERE "videos"."playlist_id" = $1  [["playlist_id", 1]]
---
	def index
		@current_user_videos = []

		current_user.playlists.each do |playlist|
			playlist.videos.each do |video|

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 2]]
---
	def show
		@video = Video.find(params[:id])

INSERT INTO "videos" ("playlist_id", "video_title", "video_description", "keywords", "video_url", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
	def create
		@video = Video.new(video_params)

		if @video.save

UPDATE "videos" SET "video_url" = $1, "updated_at" = $2 WHERE "videos"."id" = $3  [["video_url", "https://s3.ap-south-1.amazonaws.com/demo-eduly-videos/346613_35daf83fc14a9ed30331018a5d9a8145/346613.mpd"], ["updated_at", "2016-09-19 14:26:11.468534"], ["id", 1]]
---
	def update
		if @video.update(video_params)

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", 1]]
---
		def set_video
			video = Video.find(params[:id])
			playlist_video = Playlist.find(video.playlist_id)