Eduly Video Platform/old-eduly/app/views/home/explore.html.erb

SELECT  "videos".* FROM "videos" WHERE "videos"."playlist_id" = $1  ORDER BY "videos"."id" ASC LIMIT 1  [["playlist_id", 1]]
---

										<%= image_tag playlist.videos.first.image.url(:medium), class: "post-icon img-responsive" %>