Eduly Video Platform/old-eduly/app/views/videos/_form.html.erb

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1  ORDER BY "playlists"."playlist_title" ASC  [["user_id", 1]]
---
		<%= f.label :playlist %>
		<%= f.select :playlist_id, current_user.playlists.order(:playlist_title).collect{ |p| [p.playlist_title, p.id] }, {}, class: 'form-control' %>